// 1 - Дано натуральное число n. Выведите все числа от 1 до n.
//
// let n = 20;
// let nums = (i) => {
//     console.log(i);
//     i++;
//     if (i > n) {
//         return;
//     }
//     nums(i);
// }
// nums(1);


// 2 - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//
// let nums = (a, b) => {
//     if (a < b) {
//         for (let i = a; i <= b; i++) {
//             console.log(i);
//         }
//     } else if (a > b) {
//         for (let i = a; i >= b; i--) {
//             console.log(i);
//         }
//     }
// }
// nums(13, 34);


// 3 -  функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//     EXAMPLE:
//     foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//     foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//     foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// let array = [9, 8, 0, 4];
// let replaceIndex = (arr, i) => {
//     for (let j = 0; j < arr.length; j++) {
//         if (j === i) {
//             let num = arr[j];
//             arr[j] = arr[j+1]
//             arr[j+1] = num;
//         }
//     }
//     return arr;
// }
// console.log(replaceIndex(array, 1))


// 4 - Сворити функцію яка буде переносити елементи з значенням 0 у кінець масиву. Зберігаючи при цьому порядок не нульових значень.
//     Двожина масиву від 2 до 100
// EXAMPLE:
//     [1,0,6,0,3] => [1,6,3,0,0]
//     [0,1,2,3,4] => [1,2,3,4,0]
//     [0,0,1,0]   => [1,0,0,0]
//
// let array = [1, 0, 6, 0, 3];
// let moveZeros = (arr) => {
//     for (let i = arr.length - 1, j = i; i >= 0; i--) {
//         if (arr[i] === 0) {
//             let k = i, tmp = arr[i];
//             while (k < j)
//                 arr[k] = arr[++k];
//             arr[j--] = tmp;
//         }
//     }
//     return arr;
// }
// console.log(moveZeros(array))
